import { painter } from "../../lib4.mjs";
export const name = "街灯（灯り石）";
export const category = "object";
export const pal = { o: "#181c28", i: "#3a4258", I: "#5a6482", h: "#8a94b4", y: "#ffe27a", Y: "#fff6c0", g: "#f0a830", G: "#c47a20", a: "#ffd0f0", S: "#222630", p: "#a8e8f0" };
const p = painter();
// 灯り石のかご
p.poly([[16, 2], [11, 6], [21, 6]], "i"); p.rect(15, 2, 16, 3, "I"); p.pts([[11, 6]], "h");
p.rect(10, 6, 21, 7, "I"); p.rect(10, 6, 21, 6, "h");
p.rect(11, 8, 20, 15, "i");
p.poly([[16, 8], [20, 11.5], [16, 15], [12, 11.5]], "y"); p.poly([[16, 9], [13, 11.5], [16, 13]], "Y"); p.poly([[16, 13], [20, 11.5], [16, 15]], "g");
p.pts([[15, 10], [14, 11]], "Y"); p.pts([[19, 12], [18, 13]], "G");
p.rect(11, 8, 11, 15, "I"); p.rect(20, 8, 20, 15, "i"); p.rect(15, 8, 16, 8, "I");
p.pts([[8, 11], [23, 11], [16, 0], [9, 8], [22, 8]], "p");
p.rect(10, 16, 21, 17, "I"); p.rect(10, 17, 21, 17, "i"); p.rect(12, 18, 19, 18, "i");
// 支柱
p.rect(15, 19, 16, 26, "I"); p.rect(16, 19, 16, 26, "i"); p.rect(14, 22, 17, 22, "I"); p.rect(14, 23, 17, 23, "i");
// 台座
p.rect(12, 25, 19, 27, "I"); p.rect(12, 25, 19, 25, "h"); p.rect(17, 26, 19, 27, "i"); p.rect(11, 27, 20, 28, "i"); p.rect(11, 27, 13, 27, "I");
p.outline("o");
p.shadow(19, 29, 9, 1.6, "S");
export const rows = p.rows();
